In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'col_str':['hello',np.NaN, 'World'], 
                   'col_date': [pd.to_datetime("05/14/2021"), pd.to_datetime("06/17/2021"), pd.NaT], 
                   'col_float': [None, 3.14, 1.61803]})

In [4]:
display(df)

  col_str   col_date  col_float
0   hello 2021-05-14        NaN
1     NaN 2021-06-17    3.14000
2   World        NaT    1.61803

In [5]:
df.dtypes

col_str              object
col_date     datetime64[ns]
col_float           float64
dtype: object

In [6]:
df.fillna({'col_str': 'NotAvailable', 'col_date': pd.to_datetime("01/01/2020"), 'col_float': '0.0'})

        col_str   col_date col_float
0         hello 2021-05-14       0.0
1  NotAvailable 2021-06-17      3.14
2         World 2020-01-01   1.61803

In [7]:
df.fillna(method='bfill')

  col_str   col_date  col_float
0   hello 2021-05-14    3.14000
1   World 2021-06-17    3.14000
2   World        NaT    1.61803

In [8]:
df.fillna(method='bfill').fillna(method='pad')

  col_str   col_date  col_float
0   hello 2021-05-14    3.14000
1   World 2021-06-17    3.14000
2   World 2021-06-17    1.61803

In [9]:
df.fillna({'col_str': 'NotAvailable', 'col_date': pd.to_datetime("01/01/2020"), 'col_float': df.col_float.mean()})

        col_str   col_date  col_float
0         hello 2021-05-14   2.379015
1  NotAvailable 2021-06-17   3.140000
2         World 2020-01-01   1.618030

In [10]:
df.fillna('NA').dtypes

col_str      object
col_date     object
col_float    object
dtype: object

In [13]:
df

  col_str   col_date  col_float
0   hello 2021-05-14        NaN
1     NaN 2021-06-17    3.14000
2   World        NaT    1.61803

In [12]:
df.astype(str).fillna('NA')

  col_str    col_date col_float
0   hello  2021-05-14       nan
1     nan  2021-06-17      3.14
2   World         NaT   1.61803

In [16]:
df.astype(str).replace('nan', 'NA').replace('NaT', 'NA')

  col_str    col_date col_float
0   hello  2021-05-14        NA
1      NA  2021-06-17      3.14
2   World          NA   1.61803

In [18]:
df.fillna(pd.NA).astype(str)

  col_str    col_date col_float
0   hello  2021-05-14      <NA>
1    <NA>  2021-06-17      3.14
2   World         NaT   1.61803